src/Documents/НачислениеДивидендовОрганизаций/НачислениеДивидендовОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеДивидендовОрганизаций</name>
  <comment>(Регл)</comment>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСРаботникамиОрганизаций</registerRecords>
  <registerRecords>CalculationRegister.ОсновныеНачисленияРаботниковОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоНДФЛ</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДивидендыНачисляемые</name>
    <comment>Суммы распределяемых дивидендов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаОднуАкцию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>Физлицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоАкций</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.СотрудникиОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>НДФЛ</name>
      <comment>НДФЛ</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ГражданствоФизЛиц/ГражданствоФизЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГражданствоФизЛиц</name>
  <comment>(Общ)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Страна</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.КлассификаторСтранМира</types>
    </type>
  </resources>
  <resources>
    <name>НеИмеетПравоНаПенсию</name>
    <comment>(Регл)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеЯвляетсяНалоговымРезидентом</name>
    <comment>(Регл)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/AccumulationRegisters/ВзаиморасчетыСРаботникамиОрганизаций/ВзаиморасчетыСРаботникамиОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСРаботникамиОрганизаций</name>
  <comment>(Регл)</comment>
  <resources>
    <name>СуммаВзаиморасчетов</name>
    <comment>Сумма в валюте взаиморасчетов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийВзаиморасчетыСРаботникамиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактерВыплаты</name>
    <type>
      <types>EnumRef.ХарактерВыплатыЗарплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВыплаты</name>
    <type>
      <types>EnumRef.СпособыВыплатыЗарплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ведомость</name>
    <type>
      <types>DocumentRef.ЗарплатаКВыплатеОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОкругления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодВзаиморасчетов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/ВзаиморасчетыПоНДФЛ/ВзаиморасчетыПоНДФЛ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыПоНДФЛ</name>
  <comment>(Регл)</comment>
  <resources>
    <name>Налог</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Доход</name>
    <comment>Объект обложения</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеподтвержденнаяСумма</name>
    <comment>Неподтвержденная сумма налога</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НалоговыйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЛьгот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Авторасчет</name>
    <comment>Авторасчет</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <comment>Сторно</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Льгота</name>
    <type>
      <types>CatalogRef.ВидыЛьготРаботниковОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтавки</name>
    <type>
      <types>EnumRef.ВидыСтавокНДФЛ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоходПолный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УвеличеннаяСтавка</name>
    <type>
      <types>EnumRef.ВидыСтавокНДФЛ</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоходНДФЛ</name>
    <type>
      <types>CatalogRef.ВидыДоходовНДФЛ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодВзаиморасчетов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/ВидыСтавокНДФЛ/ВидыСтавокНДФЛ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСтавокНДФЛ</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>Уменьшенная</name>
    <comment>5%</comment>
  </enumValues>
  <enumValues>
    <name>Основная</name>
    <comment>13% (15%)</comment>
  </enumValues>
  <enumValues>
    <name>Двойная</name>
    <comment>26% (30%)</comment>
  </enumValues>
  <enumValues>
    <name>НеОблагается</name>
  </enumValues>
  <enumValues>
    <name>СтавкаШахтеров</name>
    <comment>10%</comment>
  </enumValues>
  <enumValues>
    <name>Увеличенная</name>
    <comment>17%</comment>
  </enumValues>
</mdclass:Enum>

src/Enums/КодыОперацийВзаиморасчетыСРаботникамиОрганизаций/КодыОперацийВзаиморасчетыСРаботникамиОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КодыОперацийВзаиморасчетыСРаботникамиОрганизаций</name>
  <enumValues>
    <name>Начисления</name>
  </enumValues>
  <enumValues>
    <name>Взносы</name>
  </enumValues>
  <enumValues>
    <name>НДФЛ</name>
  </enumValues>
  <enumValues>
    <name>Удержания</name>
  </enumValues>
  <enumValues>
    <name>Займы</name>
  </enumValues>
  <enumValues>
    <name>Выплата</name>
  </enumValues>
  <enumValues>
    <name>ПереносОстатковНаСледующийМесяц</name>
  </enumValues>
  <enumValues>
    <name>ПереносОстатковСПредыдущегоМесяца</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВидыЗанятостиВОрганизации/ВидыЗанятостиВОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗанятостиВОрганизации</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>ОсновноеМестоРаботы</name>
  </enumValues>
  <enumValues>
    <name>Совместительство</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннееСовместительство</name>
  </enumValues>
</mdclass:Enum>

src/Documents/НачислениеДивидендовОрганизаций/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Выполняет распределение общей суммы дивидендов между акционерами пропорционально количеству акций
Процедура РассчитатьДивиденды() Экспорт
	
	ВсегоАкций = Начисления.Итог("КоличествоАкций");
	
	Если НаОднуАкцию Тогда
		// Сумму к начислению указанна в расчете на одну акцию
		СуммаНаАкцию =  ДивидендыНачисляемые;
		Для каждого  Строка Из Начисления Цикл
			Строка.Результат = Строка.КоличествоАкций * СуммаНаАкцию;
		КонецЦикла; 
	Иначе
		// Начисляемые дивиденды надо распределить пропорционально количеству акций			
		МассивСуммКНачислению = ОбщегоНазначения.РаспределитьПропорционально(ДивидендыНачисляемые,Начисления.ВыгрузитьКолонку("КоличествоАкций"));
		Если МассивСуммКНачислению <> Неопределено Тогда
			Начисления.ЗагрузитьКолонку(МассивСуммКНачислению,"Результат")
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

// Выполняет распределение общей суммы полученных дивидентов(вычета) между акционерами пропорционально количеству акций
// Вычеты распределяются только между налоговыми резидентами
Процедура РассчитатьНДФЛ() Экспорт
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаНачисления", КонецМесяца(ПериодРегистрации));

	Запрос.УстановитьПараметр("СтавкаРезидента", ПроведениеРасчетов.ПолучитьСтавкуНДФЛ(КонецМесяца(ПериодРегистрации), Перечисления.ВидыСтавокНДФЛ.Основная));
	Запрос.УстановитьПараметр("СтавкаНеРезидента", ПроведениеРасчетов.ПолучитьСтавкуНДФЛ(КонецМесяца(ПериодРегистрации), Перечисления.ВидыСтавокНДФЛ.Основная));
	
    // Описание текста запроса:
    // 1. Выборка "НачислениеДивидендовОрганизацииНачисления": 
	//		Выбираются строки документа.  
	// 2. Выборка "ГражданствоФизЛицСрезПоследних": 
	//		Из регистра сведений о гражданстве выбираем информацию о налоговом резидентстве работника - 
	//		для расчета вычетов по НДФЛ и сумм НДФЛ
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачислениеДивидендовОрганизацииНачисления.Сотрудник,
	|	НачислениеДивидендовОрганизацииНачисления.КоличествоАкций,
	|	НачислениеДивидендовОрганизацииНачисления.Результат,
	|	НачислениеДивидендовОрганизацииНачисления.НДФЛ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ГражданствоФизЛицСрезПоследних.НеЯвляетсяНалоговымРезидентом, ЛОЖЬ)
	|			ТОГДА &СтавкаНеРезидента
	|		ИНАЧЕ &СтавкаРезидента
	|	КОНЕЦ КАК СтавкаНДФЛ
	|ИЗ Документ.НачислениеДивидендовОрганизаций.Начисления КАК НачислениеДивидендовОрганизацииНачисления
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&ДатаНачисления) КАК ГражданствоФизЛицСрезПоследних
	|ПО		НачислениеДивидендовОрганизацииНачисления.Сотрудник.Физлицо = ГражданствоФизЛицСрезПоследних.ФизЛицо
	|
	|ГДЕ НачислениеДивидендовОрганизацииНачисления.Ссылка = &ДокументСсылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НачислениеДивидендовОрганизацииНачисления.НомерСтроки
	|";
	
	ВременнаяТаблица = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаТЧ Из ВременнаяТаблица Цикл
		СтрокаТЧ.НДФЛ = Макс(СтрокаТЧ.Результат,0) * СтрокаТЧ.СтавкаНДФЛ;
	КонецЦикла;
	
	Начисления.Загрузить(ВременнаяТаблица);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

Функция СформироватьЗапросПоШапке()

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	Запрос.УстановитьПараметр("парамПустаяОрганизация", Справочники.Организации.ПустаяСсылка());

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачислениеДивидендовОрганизаций.Дата,
	|	НачислениеДивидендовОрганизаций.Организация,
	|	НачислениеДивидендовОрганизаций.ПериодРегистрации,
	|	ВЫБОР
	|		КОГДА НачислениеДивидендовОрганизаций.Организация.ГоловнаяОрганизация = &парамПустаяОрганизация
	|			ТОГДА НачислениеДивидендовОрганизаций.Организация
	|		ИНАЧЕ НачислениеДивидендовОрганизаций.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	НачислениеДивидендовОрганизаций.Организация КАК ОбособленноеПодразделение,
	|	НачислениеДивидендовОрганизаций.Ответственный,
	|	НачислениеДивидендовОрганизаций.Ссылка
	|ИЗ
	|	Документ.НачислениеДивидендовОрганизаций КАК НачислениеДивидендовОрганизаций
	|ГДЕ
	|	НачислениеДивидендовОрганизаций.Ссылка = &ДокументСсылка";

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоШапке()

Функция СформироватьЗапросПоНачисления()

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	Запрос.УстановитьПараметр("ДатаНачисления", КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамСотрудники", Начисления.ВыгрузитьКолонку("Сотрудник"));

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Основной.НомерСтроки			КАК НомерСтроки,
	|	Основной.Сотрудник			КАК Сотрудник,
	|	Основной.Сотрудник			КАК Назначение,
	|	Основной.Ссылка.Организация	КАК Организация,
	|	&ПериодРегистрации КАК ПериодВзаиморасчетов,
	|	&ПериодРегистрации КАК НалоговыйПериод,
	|	&ПериодРегистрации КАК Период,
	|	&ПериодРегистрации КАК ПериодРегистрации,
	|	&ПериодРегистрации						КАК ПериодДействияНачало,
	|	КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ) КАК ПериодДействияКонец,
	|	&ПериодРегистрации						КАК БазовыйПериодНачало,
	|	КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ) КАК БазовыйПериодКонец,
	|
	|	Основной.Результат КАК Результат,
	|	Основной.Результат КАК СуммаВзаиморасчетов,
	|	ЗНАЧЕНИЕ(Перечисление.КодыОперацийВзаиморасчетыСРаботникамиОрганизаций.Начисления) КАК КодОперации,
	|	ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ДивидендыРаботников) КАК ВидРасчета,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоНачисленнымДивидендам ) КАК СчетУчета,
	|
	|	ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код12) КАК ДоходНДФЛ,
	|	Основной.Результат КАК Доход,
	|	Основной.НДФЛ КАК Налог,
	|	Работники.ПодразделениеОрганизации,
	|ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДФЛ.Основная) КАК ВидСтавки
	
	|ИЗ Документ.НачислениеДивидендовОрганизаций.Начисления КАК Основной
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Работники.Сотрудник,
	|			Работники.ПодразделениеОрганизации
	|		ИЗ
	|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаНачисления,
	|				 Организация = &Организация
	|					И Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
	|					И Сотрудник В (&парамСотрудники)) КАК Работники
	|			) КАК Работники
	|		ПО Работники.Сотрудник = Основной.Сотрудник
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&ДатаНачисления) КАК ГражданствоФизЛицСрезПоследних
	|ПО		Основной.Сотрудник.Физлицо = ГражданствоФизЛицСрезПоследних.ФизЛицо
	|
	|ГДЕ	Основной.Ссылка = &ДокументСсылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";

	Запрос.Текст = ТекстЗапроса;

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоНачисления()


Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок)

	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

Процедура ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ, Заголовок)
	
	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
	""" табл. части ""Начисления"": ";

	// Сотрудник
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Сотрудник) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указан акционер!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры


Процедура ДобавитьСтрокуОсновныхНачислений(ВыборкаПоСтрокамДокумента, НаборЗаписей)
	
	Движение = НаборЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(Движение, ВыборкаПоСтрокамДокумента);

КонецПроцедуры // ДобавитьСтрокуОсновныхНачислений()

Процедура ДобавитьСтрокуВзаиморасчетыСРаботникамиОрганизаций(ВыборкаПоСтрокамДокумента)
	
	// ВзаиморасчетыСРаботникамиОрганизаций
	Движение = Движения.ВзаиморасчетыСРаботникамиОрганизаций.Добавить();
	ЗаполнитьЗначенияСвойств(Движение, ВыборкаПоСтрокамДокумента);
	Движение.ВидДвижения			= ВидДвиженияНакопления.Приход;

	Движение = Движения.ВзаиморасчетыСРаботникамиОрганизаций.Добавить();
	ЗаполнитьЗначенияСвойств(Движение, ВыборкаПоСтрокамДокумента);
	Движение.ВидДвижения			= ВидДвиженияНакопления.Расход;
	Движение.СуммаВзаиморасчетов	= ВыборкаПоСтрокамДокумента.Налог;
	Движение.КодОперации			= Перечисления.КодыОперацийВзаиморасчетыСРаботникамиОрганизаций.НДФЛ;
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамНакопления()

Процедура ДобавитьСтрокуВзаиморасчетыПоНДФЛ(ВыборкаПоСтрокамДокумента)
	
	// ВзаиморасчетыСРаботникамиОрганизаций
	Движение = Движения.ВзаиморасчетыПоНДФЛ.Добавить();
	ЗаполнитьЗначенияСвойств(Движение, ВыборкаПоСтрокамДокумента);
	Движение.ВидДвижения			= ВидДвиженияНакопления.Приход;
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамНакопления()



////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)

	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);

	РезультатЗапросаПоШапке = СформироватьЗапросПоШапке();
	ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();

	Если ВыборкаПоШапкеДокумента.Следующий() Тогда

		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);

		Если НЕ Отказ Тогда
			
			ВыборкаПоНачислениям = СформироватьЗапросПоНачисления().Выбрать();
			Пока ВыборкаПоНачислениям.СледующийПоЗначениюПоля("НомерСтроки") Цикл 

				ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, Отказ, Заголовок);
				Если НЕ Отказ Тогда
					
					// В регистр расчета начисления пишем только для работников организации
					ДобавитьСтрокуОсновныхНачислений(ВыборкаПоНачислениям, Движения.ОсновныеНачисленияРаботниковОрганизаций);
					ДобавитьСтрокуВзаиморасчетыСРаботникамиОрганизаций(ВыборкаПоНачислениям);
					ДобавитьСтрокуВзаиморасчетыПоНДФЛ(ВыборкаПоНачислениям);
					
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли; 
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(Начисления,, "Сотрудник");
	ПроцедурыУправленияПерсоналом.ЗаполнитьФизЛицоПоТЧ(Начисления);
	
КонецПроцедуры
